{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Align Landing Page UI with MAGICAL SERVICE HTML Layout",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Update LandingPage to match the provided MAGICAL SERVICE HTML structure, Tailwind styling, copy, and link targets (navbar, hero, rates, benefits, UPI/review, WhatsApp FAB).",
      "acceptanceCriteria": [
        "Landing page renders the navbar, hero, service rates grid, benefits strip, UPI/review section, and WhatsApp floating button in the same order as the provided HTML snippet.",
        "All user-facing text matches the provided snippet exactly (including capitalization for headings like \"MAGICAL SERVICE\" and \"Scan to Pay (UPI)\").",
        "Links match the snippet exactly: phone uses `tel:+918000262644`, WhatsApp uses `https://wa.me/918000262644`, review uses `https://share.google/CAZwztDsnRKHBaOAM`.",
        "Service cards have hover lift behavior consistent with the snippet (`hover:-translate-y-2` and transition).",
        "UPI QR image uses the exact external `api.qrserver.com` URL from the snippet and displays the UPI ID text as \"UPI ID: jrg7311@okicici\"."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/LandingPage.tsx",
          "operation": "modify",
          "description": "Restructure the landing page JSX to follow the provided HTML snippet order and layout: (1) sticky top navbar with text-only brand \"MAGICAL SERVICE\" and \"Ahmedabad & Gandhinagar\" plus phone CTA linking to `tel:+918000262644`; (2) add the blue hero section with heading \"Professional Cleaning Service\", subheading \"Trusted Experts in Ahmedabad & Gandhinagar\", and primary \"WhatsApp Inquiry\" button linking to `https://wa.me/918000262644`; (3) render the \"Our Service Rates\" section with underlined title and four service-rate cards (Sofa/AC Jet/Mattress/Carpet-Chair) using the snippet’s rounded corners, borders, and hover translate/transition behavior; (4) render the 3-item benefits strip including the snippet’s mobile border-top behavior; (5) render the UPI + review section with heading \"Scan to Pay (UPI)\", QR image using the exact provided URL, and the text \"UPI ID: jrg7311@okicici\", plus the Google review link button to `https://share.google/CAZwztDsnRKHBaOAM`; keep the floating WhatsApp button fixed bottom-right linking to `https://wa.me/918000262644`."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Replace any FontAwesome `<i class=\"...\">` icon usage implied by the HTML with existing project icon libraries while preserving visual intent.",
      "acceptanceCriteria": [
        "No FontAwesome dependency is introduced for this change.",
        "All icons render without runtime errors and are visually representative of the intended meaning (phone, WhatsApp, service icons, benefit icons)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/LandingPage.tsx",
          "operation": "modify",
          "description": "Ensure all icons used for phone/WhatsApp, service-rate cards, and benefits are implemented via the existing icon approach already present in the project (e.g., `lucide-react` and `react-icons`) and that no FontAwesome `<i class=\"...\">` usage or new FontAwesome dependency is added."
        }
      ]
    }
  ]
}